from flask import Flask, render_template, request

app = Flask(__name__)





# جميع الأسئلة + خيارات + الجواب الصحيح
questions = [
    {
        'id': 1,
        'question': "أثناء قيادتك في المدينة، شاهدت مجموعة مسلحة توقف سيارة إسعاف وتطلب من المسعف علاج أحدهم تحت تهديد السلاح. ما هو التصرف الصحيح؟",
        'options': [
            "استخدام الرهينة ضمن سيناريو مُتفق عليه ولا توجد مخالفة.",
            "مخالفة قوانين العصابات فقط لتهديدهم أحد العاملين بالمدينة.",
            "مخالفة صريحة لقانون الجرائم: يُمنع خطف المسعفين أو إجبارهم على المساعدة.",
            "لا توجد مخالفة لأن المسعف لم يتعرض للأذى الجسدي."
        ],
        'answer': 2
    },
    {
        'id': 2,
        'question': "تم إغماؤك بعد تبادل إطلاق نار، وعندما أفاقك المسعف بدأت تتحدث عن تفاصيل المعركة السابقة. ما المخالفة التي ارتكبتها؟",
        'options': [
            "لا توجد مخالفة طالما لم تذكر أسماء.",
            "خرق قانون الحياة الجديدة NLR: يجب نسيان ما حدث قبل الإغماء.",
            "ميتا جيمنج لأنك استعدت معلومات من خارج اللعبة.",
            "باور جيمنج لأنك تحدثت أثناء الإغماء."
        ],
        'answer': 1
    },
    {
        'id': 3,
        'question': "دخلت منطقة الورشة ووجدت لاعباً آخر يقوم بسرقة سيارة أمامك، فقمت بإطلاق النار عليه. ماذا يعني ذلك؟",
        'options': [
            "سلوك طبيعي لأن الجريمة تستوجب الرد.",
            "RDM لأنك أطلقت النار دون تفاوض.",
            "مخالفة قانونية لأن إطلاق النار داخل المناطق الآمنة ممنوع.",
            "قانونياً مسموح بالقتل داخل الورشات."
        ],
        'answer': 2
    },

    {
        'id': 4,
        'question': "قمت بخطف رهينة وتمكنت من الهرب، لكنك غيرت شكل وجهك وشعرك فوراً لتجنب التبليغ. ما الخطأ هنا؟",
        'options': [
            "تصرف صحيح لأنه تم تغيير الشخصية بعد السيناريو.",
            "خرق لقانون التغيير المرئي: يجب الانتظار 20 دقيقة بعد العملية الإجرامية.",
            "مسموح فقط إذا لم تكن الشرطة متواجدة.",
            "لا توجد مخالفة طالما لم يرَك أحد."
        ],
        'answer': 1
    },
    {
        'id': 5,
        'question': "كنت في بث مباشر داخل المدينة، وخلال البث ذكرت أن أحد اللاعبين يستخدم ميتا جيمنج. ما المخالفة هنا؟",
        'options': [
            "خرق لقانون المدينة لأنك تكلمت خارج الرول.",
            "لا توجد مخالفة طالما الهدف تنبيه الجمهور.",
            "مخالفة خاصة بالبث فقط.",
            "خرق لقانون العصابات."
        ],
        'answer': 2
    },
    {
        'id': 6,
        'question': "أثناء قيادتك في المدينة بسرعة عالية دون مبرر، لاحظتك الشرطة وقامت باستيقافك. هل تعتبر مخالفاً؟",
        'options': [
            "نعم، القيادة غير واقعية تعتبر باور جيمنج.",
            "لا، مادام لم تتجاوز الإشارات الحمراء.",
            "يُسمح بالسرعة داخل المدينة.",
            "لا توجد مخالفة إلا إذا اصطدمت بشخص."
        ],
        'answer': 3
    },
    {
        'id': 7,
        'question': "تم الإمساك بك بعد تنفيذ عملية سرقة بنك، وقبل سجنك خرجت من السيرفر. ما الحكم هنا؟",
        'options': [
            "لا مشكلة طالما لم يتم التحقيق بعد.",
            "خرق لقانون الخروج من السيرفر ويعاقب عليه.",
            "خرق لقانون العصابات فقط.",
            "مخالفة بسيطة تنتهي بتحذير."
        ],
        'answer': 1
    },
    {
        'id': 8,
        'question': "أحد الأشخاص صدم سيارتك دون قصد، فقمت بخطفه وتبرير ذلك بوجود عداوة. ما الخطأ؟",
        'options': [
            "لا مشكلة طالما لم تؤذِه.",
            "السلوك عادي ضمن قانون العصابات.",
            "تكوين عداوة بسبب سبب تافه غير مسموح.",
            "مسموح إذا كررها مرتين."
        ],
        'answer': 2
    },
    {
        'id': 9,
        'question': "شاهدت مشادة بين الشرطة ومجموعة مسلحة داخل المحكمة، فقمت بالتصوير والنشر على تويتر. ما النتيجة؟",
        'options': [
            "مخالفة للقانون لأن المحكمة منطقة آمنة ولا يسمح بالتصوير.",
            "لا مشكلة طالما لم تتدخل.",
            "خرق لقانون العصابات.",
            "مخالفة للبث فقط."
        ],
        'answer': 0
    },


    {
        'id': 10,
        'question': "أثناء لعبك كشرطي، كنت ترتدي الزي الرسمي وتستخدم سيارة مدنية غير مرخصة من الوزارة، بحجة أن مركبتك الحكومية تعطلت. لم تبلغ الراديو ولم تطلب وحدة نقل، بل تحركت من تلقاء نفسك وتدخلت في مشاجرة بين عصابتين السؤال ماهوا الخطا الذي ارتكبتة كلاعب تابع لوزارة الداخلية وفقا لقوانين السيرفر ",
        'options': [
            "مخالفة بروتوكول وزارة الداخلية +مخالفة بروتوكول الخوف على الحياة",
            "مخالفات بسيطة لاتستدعي اي  اجراء",
            " لا يوجد أي مخالفة لأن الظروف كانت تستوجب تدخلًا عاجلًا.",
            "مخالفة لقانونNVLلأنك قد تقتل لاحقا في السيناريو"
        ],
        'answer': 0
    },

    {
        'id': 11,
        'question': "قمت بتغيير شكل وجهك وتسريحة شعرك بعد تنفيذ عملية سرقة بنك مباشرة، بعد أقل من 10 دقائق، وقبل أن يتم الإمساك بك من قبل الشرطة أو انتهاء حالة المطاردة.",
        'options': [
            "خرق لقانون تغيير الملامح، حيث يجب الانتظار 20 دقيقة بعد العملية الإجرامية.",
            ". لا توجد مخالفة لأنك لم تغير ملابسك فقط الوجه",
            "خرق لقانون NVL لأنك لم تخف على حياتك.",
            "مخالفة تخص التمثيل فقط ولا تستوجب عقوبة."
        ],
        'answer': 0
    },
   
   
    {
        'id': 12,
        'question': "خلال تمثيلك لشخصية موظف إسعاف، قمت بالتوجه لمكان إطلاق نار بين الشرطة والعصابة لتقديم الإسعافات، ولكنك كنت ترتدي ملابس مدنية وتستخدم سيارة غير تابعة للوزارة، وبدون تنسيق مع المسؤولين في الديسكورد.ما هي المخالفات التي ارتكبتها بصفتك تابع لوزارة الصحة؟",
        'options': [
            "لا يوجد خرق طالما أنك قدمت المساعدة.",
            "فقط مخالفة استخدام سيارة غير رسمية.",
            "مخالفة تخص الوقت وليس التصرف.",
            " جميع الاجابات صحيحة"
        ],
        'answer': 0
    },
  
    {
    'id': 13,
    'question': "أثناء سرقة متجر صغير، قام أحد أعضاء عصابتك بإطلاق النار على رهينة رغم أنه لم يقاوم. ما هو الحكم؟",
    'options': [
        "مسموح لأنه جزء من التهديد.",
        "مخالفة قانونية واضحة، لا يجوز قتل من ينفذ الأوامر.",
        "تصرف منطقي ضمن سيناريو التهديد.",
        "مسموح فقط إن كان الرهينة يحمل سلاح."
    ],
    'answer': 1
},
{
    'id': 14,
    'question': "مواطن أنقذك بعد الإغماء ثم أخبرك أنك كنت في تبادل إطلاق نار، وذكّرك بكل التفاصيل. هل في ذلك خطأ؟",
    'options': [
        "نعم، خرق لقانون NLR يمنع المسعف من تذكيرك.",
        "لا، لأنه فقط قام بتذكيرك بما حصل.",
        "مسموح طالما لم يعطِك أوامر.",
        "غير مخالف لأنه من نفس مجموعتك."
    ],
    'answer': 1
},
{
    'id': 15,
    'question': "كنت في بث مباشر داخل السيرفر، وذكرت أثناء البث سبب حظرك السابق. ما هو الخطأ هنا؟",
    'options': [
        "خرق لقوانين البث: يمنع التطرق للأمور الإدارية.",
        "لا مشكلة طالما الحديث ضمن الرول.",
        "مسموح إذا كان المشاهدون يعرفون القصة.",
        "مخالفة صغيرة لا تستدعي محاسبة."
    ],
    'answer': 0
},
{
    'id': 16,
    'question': "لاعب صدمك بسيارته وهرب، فانتظرته لاحقاً في أحد الأزقة وقمت بقتله مباشرة. ما المخالفة؟",
    'options': [
        "لا توجد مخالفة، الرد كان مبرراً.",
        "خرق لقانون RDM,VDM: لم يحصل تفاوض أو تمثيل.",
        "مسموح فقط في حال وجود شاهد.",
        "القتل مبرر في حالات المطاردة."
    ],
    'answer': 1
},
{
    'id': 17,
    'question': "أثناء تحقيق طويل مع مجرم في قسم الشرطة، استغرق الضابط أكثر من 30 دقيقة دون سيناريو كبير. ما الحكم؟",
    'options': [
        "مخالفة لقانون الشرطة، الحد الأقصى للتحقيق 15 دقيقة.",
        "تصرف طبيعي إذا كان التحقيق مفصل.",
        "مسموح إذا وافق المشتبه عليه.",
        "مخالفة من المشتبه لأنه لم يطلب محامي."
    ],
    'answer': 0
},
{
    'id': 18,
    'question': "لاعب قام بخطف تاكسي من المدينة بعد أن طلبه من التطبيق، ثم استخدمه كرهينة. هل هذا مسموح؟",
    'options': [
        "نعم، طالما لم يتعرض للأذى.",
        "ممنوع استدراج موظف مدينة بهدف خطفه.",
        "مسموح إذا كان مسلح.",
        "يعتمد على المكان."
    ],
    'answer': 1
},
{
    'id': 19,
    'question': "شخص من الشرطة أطلق النار عليك من دراجة نارية خلال مطاردة. ما هو الخطأ؟",
    'options': [
        "لا توجد مخالفة لأنه عسكري.",
        "خرق لقانون الشرطة، لا يُسمح بإطلاق النار من الدراجة.",
        "مسموح فقط إذا كنت مسلح.",
        "تصرف طبيعي أثناء الفايت."
    ],
    'answer': 1
},

   
    {
        'id': 20,
        'question': "أثناء التحقيق مع مجرم في المركز، قام الضابط بتفتيشه وسجنه دون إبلاغه بجريمته. ما الخطأ هنا؟",
        'options': [
            "لا توجد مخالفة، التحقيق كان مختصر.",
            "خرق لقانون الشرطة: يجب إعلام المجرم بجريمته والغرامة.",
            "خرق قانون العدالة.",
            "خرق لقانون السجون."
        ],
        'answer': 1
    }

        

]

@app.route('/')
def exam():
    return render_template('exam.html', questions=questions)

@app.route('/submit', methods=['POST'])
def submit():
    score = 0
    for q in questions:
        selected = request.form.get(f'q{q["id"]}')
        if selected and int(selected) == q['answer']:
            score += 1
    return render_template('result.html', score=score, total=len(questions))

if __name__ == '__main__':
    app.run(debug=True, host='0.0.0.0', port=8000)
