from flask import Flask, render_template, request, session, redirect, url_for
import random

app = Flask(__name__)
app.secret_key = 'supersecretkey'  # ضروري لتفعيل الجلسة





# جميع الأسئلة + خيارات + الجواب الصحيح
questions = [




    {
        'id': 1,
        'question': "أثناء قيادتك في المدينة، شاهدت مجموعة مسلحة توقف سيارة إسعاف وتطلب من المسعف علاج أحدهم تحت تهديد السلاح. ما هي المخالفة؟",
        'options': [
            "استخدام الرهينة ضمن سيناريو مُتفق عليه ولا توجد مخالفة.",
            "مخالفة قوانين العصابات فقط لتهديدهم أحد العاملين بالمدينة.",
            "مخالفة صريحة لقانون الجرائم: يُمنع خطف المسعفين أو إجبارهم على المساعدة.",
            "لا توجد مخالفة لأن المسعف لم يتعرض للأذى الجسدي."
        ],
        'answer': 2
    },

    {
        'id': 2,
        'question': "تم إسقاطك بعد تبادل إطلاق نار، وعندما أفاقك المسعف بدأت تتحدث عن تفاصيل المعركة السابقة. ما المخالفة التي ارتكبتها؟",
        'options': [
            "لا توجد مخالفة طالما لم تذكر أسماء.",
            "خرق قانون الحياة الجديدة NLR: يجب نسيان ما حدث قبل الإسقاط.",
            "ميتا جيمنج لأنك استعدت معلومات من خارج اللعبة.",
            "باور جيمنج لأنك تحدثت أثناء الإغماء."
        ],
        'answer': 1
    },

    {
        'id': 3,
        'question': "دخلت منطقة ورشة تصليح سيارات ووجدت لاعباً آخر يقوم بسرقة سيارة أمامك، فقمت بإطلاق النار عليه. ماذا يعني ذلك؟",
        'options': [
            "سلوك طبيعي لأن الجريمة تستوجب الرد.",
            "VDM لأنك أطلقت النار دون تفاوض.",
            "مخالفة قانونية لأن إطلاق النار داخل المناطق الآمنة ممنوع.",
            "قانونياً مسموح بالقتل داخل الورشات."
        ],
        'answer': 2
    },

    {
        'id': 4,
        'question': "قمت بخطف رهينة وتمكنت من الهرب، لكنك غيرت شكل وجهك وشعرك فوراً لتجنب التبليغ. ما الخطأ هنا؟",
        'options': [
            "تصرف صحيح لأنه تم تغيير الشخصية بعد السيناريو.",
            "خرق لقانون التغيير المرئي: يجب الانتظار 20 دقيقة بعد العملية الإجرامية.",
            "مسموح فقط إذا لم تكن الشرطة متواجدة.",
            "لا توجد مخالفة طالما لم يرَك أحد."
        ],
        'answer': 1
    },

    {
        'id': 5,
        'question': "كنت في بث مباشر داخل المدينة، وخلال البث ذكرت أن أحد اللاعبين يستخدم ميتا جيمنج. ما المخالفة هنا؟",
        'options': [
            "خرق لقانون المدينة لأنك تكلمت خارج الرول.",
            "لا توجد مخالفة طالما الهدف تنبيه الجمهور.",
          " خرق  لقانون المدينة + مخالفة خاصة بالبث ",
            "خرق لقانون العصابات."
        ],
        'answer': 2
    },

    {
        'id': 6,
        'question': "أثناء قيادتك في المدينة بسرعة عالية وغير واقعية دون اي مبرر، لاحظتك الشرطة وقامت باستيقافك. هل تعتبر مخالفاً؟",
        'options': [
            "نعم، القيادة غير واقعية تعتبر مخالفة للقوانين.",
            "لا، مادام لم تتجاوز الإشارات الحمراء.",
            "يُسمح بالسرعة داخل المدينة.",
            "لا توجد مخالفة إلا إذا اصطدمت بشخص."
        ],
        'answer': 0
    },

    {
        'id': 7,
        'question': "تم الإمساك بك بعد تنفيذ عملية سرقة بنك، وقبل سجنك خرجت من السيرفر. ما الحكم هنا؟",
        'options': [
            "لا مشكلة طالما لم يتم التحقيق بعد.",
            "خرق لقانون الخروج من السيرفر ويعاقب عليه.",
            "خرق لقانون العصابات فقط.",
            "مخالفة بسيطة تنتهي بتحذير."
        ],
        'answer': 1
    },

    {
        'id': 8,
        'question': "أحد الأشخاص صدم سيارتك دون قصد، فقمت بخطفه وتبرير ذلك بوجود عداوة. ما الخطأ؟",
        'options': [
            "لا مشكلة طالما لم تؤذِه.",
            "السلوك عادي ضمن قانون العصابات.",
            "تكوين عداوة بسبب سبب تافه غير مسموح.",
            "مسموح إذا كررها مرتين."
        ],
        'answer': 2
    },

    {
        'id': 9,
        'question': "صحفي شاهد مشادة بين الشرطة ومجموعة مسلحة داخل المحكمة، فقام بالتصوير والنشر على تويتر هل هناك مخالفة . ",
        'options': [
            "مخالفة للقانون لأن المحكمة منطقة آمنة ولا يسمح بالتصوير.",
            "خرق لقانون العصابات.",
            "مخالفة للبث فقط.",
            "لا مشكلة طالما لم تتدخل."
        ],
        'answer': 0
    },

    {
        'id': 10,
        'question': "أثناء لعبك كشرطي، كنت ترتدي الزي الرسمي وتستخدم سيارة مدنية غير مرخصة من الوزارة، بحجة أن مركبتك الحكومية تعطلت. لم تبلغ الراديو ولم تطلب وحدة نقل، بل تحركت من تلقاء نفسك وتدخلت في مشاجرة بين عصابتين السؤال ماهوا الخطا الذي ارتكبتة كلاعب تابع لوزارة الداخلية وفقا لقوانين السيرفر ",
        'options': [
            "مخالفة بروتوكول وزارة الداخلية +مخالفة بروتوكول الخوف على الحياة",
            "مخالفات بسيطة لاتستدعي اي  اجراء",
            " لا يوجد أي مخالفة لأن الظروف كانت تستوجب تدخلًا عاجلًا.",
            "مخالفة لقانونNVLلأنك قد تقتل لاحقا في السيناريو"
        ],
        'answer': 0
    },

    {
        'id': 11,
        'question': "قمت بتغيير شكل وجهك وتسريحة شعرك بعد تنفيذ عملية سرقة بنك مباشرة، بعد أقل من 10 دقائق، وقبل أن يتم الإمساك بك من قبل الشرطة أو انتهاء حالة المطاردة.",
        'options': [
            "خرق لقانون تغيير الملامح، حيث يجب الانتظار 20 دقيقة بعد العملية الإجرامية.",
            ". لا توجد مخالفة لأنك لم تغير ملابسك فقط الوجه",
            "خرق لقانون NVL لأنك لم تخف على حياتك.",
            "مخالفة تخص التمثيل فقط ولا تستوجب عقوبة."
        ],
        'answer': 0
    },
   
   
    {
        'id': 12,
        'question': "خلال تمثيلك لشخصية موظف إسعاف، قمت بالتوجه لمكان إطلاق نار بين الشرطة والعصابة لتقديم الإسعافات، ولكنك كنت ترتدي ملابس مدنية وتستخدم سيارة غير تابعة للوزارة، وبدون تنسيق مع المسؤولين في الديسكورد.ما هي المخالفات التي ارتكبتها بصفتك تابع لوزارة الصحة؟",
        'options': [
            "لا يوجد خرق طالما أنك قدمت المساعدة.",
            "فقط مخالفة استخدام سيارة غير رسمية.",
            "مخالفة تخص الوقت وليس التصرف.",
            " جميع  التصرفات خاطئة "
        ],
        'answer': 3
    },
  
    {
    'id': 13,
    'question': "أثناء سرقة متجر صغير، قام أحد أعضاء عصابتك بإطلاق النار على رهينة رغم أنه لم يقاوم. ما هو الحكم؟",
    'options': [
        "مسموح لأنه جزء من التهديد.",
        "مخالفة قانونية واضحة، لا يجوز قتل من ينفذ الأوامر.",
        "تصرف منطقي ضمن سيناريو التهديد.",
        "مسموح فقط إن كان الرهينة يحمل سلاح."
    ],
    'answer': 1
    },

    {
    'id': 14,
    'question': "مواطن أنقذك بعد الإسقاط ثم أخبرك أنك كنت في تبادل إطلاق نار، وذكّرك بكل التفاصيل. هل في ذلك خطأ؟",
    'options': [
        "نعم، خرق لقانون NLR يمنع المسعف من تذكيرك.",
        "مسموح طالما لم يعطِك أوامر.",
        "لا، لأنه فقط قام بتذكيرك بما حصل.",
        "غير مخالف لأنه من نفس مجموعتك."
    ],
    'answer': 2
    },

    {
    'id': 15,
    'question': "كنت في بث مباشر داخل السيرفر، وذكرت أثناء البث سبب حظرك السابق. ما هو الخطأ هنا؟",
    'options': [
        "لا مشكلة طالما الحديث ضمن الرول.",
        "خرق لقوانين البث: يمنع التطرق للأمور الإدارية.",
        "مسموح إذا كان المشاهدون يعرفون القصة.",
        "مخالفة صغيرة لا تستدعي محاسبة."
    ],
    'answer': 1
    },

    {
    'id': 16,
    'question': "لاعب صدمك بسيارته وهرب، فانتظرته لاحقاً في أحد الأزقة وقمت بقتله مباشرة. ما المخالفة؟",
    'options': [
        "لا توجد مخالفة، الرد كان مبرراً.",
        "مسموح فقط في حال وجود شاهد.",
        "القتل مبرر في حالات المطاردة.",
         "خرق لقانون RDM,VDM: لم يحصل تفاوض أو تمثيل.",
    ],
    'answer': 3
    },

    {
    'id': 17,
    'question': "أثناء تحقيق طويل مع مجرم في قسم الشرطة، استغرق الضابط أكثر من 30 دقيقة دون سيناريو كبير. ما الحكم؟",
    'options': [
        "مخالفة لقانون الشرطة، الحد الأقصى للتحقيق 15 دقيقة.",
        "تصرف طبيعي إذا كان التحقيق مفصل.",
        "مسموح إذا وافق المشتبه عليه.",
        "مخالفة من المشتبه لأنه لم يطلب محامي."
    ],
    'answer': 0
    },

    {
    'id': 18,
    'question': "لاعب قام بخطف تاكسي من المدينة بعد أن طلبه من التطبيق، ثم استخدمه كرهينة. هل هذا مسموح؟",
    'options': [
        "نعم، طالما لم يتعرض للأذى.",
        "ممنوع استدراج موظف مدينة بهدف خطفه.",
        "مسموح إذا كان مسلح.",
        "يعتمد على المكان."
    ],
    'answer': 1
    },

    {
    'id': 19,
    'question': "شخص من الشرطة أطلق النار عليك من دراجة نارية خلال مطاردة. ما هو الخطأ؟",
    'options': [
        "لا توجد مخالفة لأنه عسكري.",
        "مسموح فقط إذا كنت مسلح.",
        "خرق لقانون الشرطة، لا يُسمح بإطلاق النار من الدراجة.",
        "تصرف طبيعي أثناء الفايت."
        
    ],
    'answer': 2
    },

    {
    "id": 20,
    "question": "ما العقوبة المحتملة لمن يسب أو يستخدم كلام ديني أو طائفي؟",
    "options": [
      "تنبيه شفهي فقط.",
      "كتم مؤقت للصوت داخل اللعبة.",
      "حظر دائم دون إنذار.",
      "نقل اللاعب إلى السجن داخل اللعبة."
    ],
    "answer": 2
    },



    {
    "id": 21,
    "question": "  في فرض ان الشرطة قامت ياعتقالك واثناء العودة للمركز حصل عندك كراش مفاجئ وعند عودتك لم تجد احد في الموقع ماذا ستغعل ",
    "options": [
      "يُسمح بعدم الرجوع.لان الشرطة غير متواجدة",
      "العودة وتسليم نفسك للشرطة",
      "الانتظار في نفس المكان وفي حال عدم ظهور الشرطة تغادر",
      "الذهاب لجانب الشرطة في حال تعرفهم عليك تقوم بتسليم نفسك"
    ],
    "answer": 1
  },



    {
    "id": 22,
    "question": "لاعب يتحدث عن قوانين المدينة ودستورها داخل الرول، هل هذا صحيح؟",
    "options": [
      "مسموح إذا كان الحديث بنية حسنة.",
      "لا توجد مشكلة طالما أنه داخل الرول.",
      "يمنع الحديث عن القوانين داخل الرول.",
      "مسموح فقط أثناء الاجتماعات الرسمية."
    ],
    "answer": 2
  },



    {
    "id": 23,
    "question": "مواطن قام باستخدام برنامج OBS لتصوير اثناء لعبة داخل المدينة. ماهي نتيجة ذالك؟",
    "options": [
      "يُسمح بذلك إذا لم تستخدمه للبث المباشر.",
      "لا توجد مشكلة طالما أن الصوت واضح.",
      " يمنع استخدام OBS داخل المدينة.",
      "يسمح باستخدام أي برنامج تسجيل بدون قيود."
    ],
    "answer": 2
    },


    {
    "id": 24,
    "question": "قمت بتلقي معلومات من صديقك عبر Discord عن مكان أحد اللاعبين، ما اسم هذا النوع من المخالفة؟",
    "options": [
        "MetaGaming",
        "MPR",
        "NVL", 
        "PowerGaming"
         ],
    "answer": 0
    },



    {
    "id": 25,
    "question": "ما هو الحد الأقصى للرهائن المسموح في عملية سرقة؟",
    "options": [
        "مافي حد معين",
        "رهينة واحدة",
        " خمس رهائن", 
        "ثلاث رهائن"
         ],
    "answer": 0
    },

   

    {
    "id": 26,
    "question": "ذكرت قصة حقيقية من حياتك داخل الرول بلاي، ما الخطأ؟",
    "options": [
      "هذا ميتا جيمنج.",
      "هذا باور جيمنج.",
     "خرق لقوانين الرول.",
      "لا يوجد خطأ."
    ],
    "answer": 2
    },

    {
    "id": 27,
    "question": "إذا تم قتلك أثناء عملية، هل يمكن لزميلك أن يخبرك بالتفاصيل لاحقًا؟",
    "options": [
      "نعم, يجوز ذالك",
      "لا ممنوع ابدا",
      "مسموح لو رح ترجع لنفس السيناريو للاستكماله",
      "لا فقط عبر ال MRP(Minimal RolePlay)"
    ],
    "answer": 0
    },

    {   
    "id": 28,
    "question": "ما الحالة الوحيدة التي يجوز فيها قتل لاعب بدون حوار؟",
    "options": [
      "إذا قام برفع السلاح عليك مباشرة.",
      "إذا قام بتهديدك من قبل.",
      "إذا قام بالمقاومة بعد أوامرك.",
      "لا يجوز القتل أبدًا دون حوار.حسب قانون ال RDM"
    ],
    "answer": 2
    },


{
    "id": 29,
    "question": "هل يجوز ارتداء ملابس عصابة أخرى لأجل التهيب داخل الرول",
    "options": [
      "نعم،مسموح ذالك .",
      "لا، إلا بسيناريو كبير .",
      "مسموح في بعض الاحيان للتمويه.",
      "ممنوع تمامًا ولو لم تتفاعل."
    ],
    "answer": 0
  },


{
    "id": 30,
    "question": "اثناء مرورك بشارع لاحظت ان الشرطة قامت باعتقال صديقك وسيقومون باعدامة فقمت بتغير ملابسك لملابس عسكرية وقمت بتحريرة.هل يجوز ذالك؟",
    "options": [
      "نعم،يجوز ذالك .",
      "لا، لا يجوز الا بسيناريو كبير .",
      "مسموح في بعض الاحيان في مثل هذه الحالات.",
      "غير مسموح."
    ],
    "answer": 3
  },


{
    "id": 31,
    "question": "كنت بعيد عن جهازك وعند عودتك وجدت ان الشرطة تقوم باستيقافك فبقيت بدون حركة وبصمت  الى حين ذهاب الشرطة. هل يوجد خطأ في ذالك؟",
    "options": [
      "لا رول بلاي طبيعي.",
      " نعم,لأنك قم بتجاهل قانون NWL",
      "باور جيمنج لأنه تمثيل غير منطقي.",
      "نعم لايمكنك فعل ذالك."
    ],
    "answer": 3
  },

  {
    "id": 32,
    "question": "كنت في شارع وحدث معك FIGHT بطريقة عشوائية,وبعدا انتهاء الفايت وانتصارك قمت بتلويته للشخص مارأيك بذالك. ",
    "options": [
      " مسموح ذالك طالما الفايت انتهى.",
      "لا،لا يجوز التلويت.",
      "مسموح لانه يوجد بينك وبينه عداوه.",
      "مسموح فقط في المناطق المهجورة."
    ],
    "answer": 2
  },

{
    "id": 33,
    "question": "هل يسمح لك تمثيل شخصية تعاني من اضطراب نفسي يؤثر على قراراتك؟",
    "options": [
      "لا، يعتبر تمثيل غير مسؤول.",
      "مسموح ضمن إطار الرول.",
      "ممنوع لأنه يخالف الحياة الواقعية.",
      "يسمح فقط لو تم الموافق من قبل صاحب السيرفر."
    ],
    "answer": 0
  },


{
    "id": 34,
    "question": "كان لديك عداوة مع شخص منذ ايام قليلة وعاد هاذا الشخص بقيامة باذعاجك من جديد فحصلت بينكم عداوة جديدة بسببه. هل تصرفكم يوجد به غلط؟ ",
    "options": [
      "مسموح لو العداوة السابقة انتهت.",
      "يجب الانتظار اسبوع حتى تجديد العداوه بينكم",
      "نعم إذا كان عندك سبب قوي ومقنع.",
      "يسمح في حال كانت العداوه بسببه."
    ],
    "answer": 1
  },


{
    "id": 35,
    "question": "طلب احدهم من رهينة أن تطلق النار على الشرطة، وقامت الرهينه بذالك . من المخالف؟",
    "options": [
      "الرهينة فقط.",
      "اللاعبين الاثنين قامو بالمخالفة.",
      "لا أحد،يجوز ذالك فهو تمثيل حر.",
      "الخاطف فقط."
    ],
    "answer": 3
  },



{
    "id": 36,
    "question": "كنت في احد الايام تسير بشكل طبيعي ودخلت الى سوبر ماركت لكي تشتري الماء فقام احد الاشخاص المنتسبين لعصابة لوحدة بتهديدك وقتلك فاصبح لديك سبب للعداوة هل ستكون العداوه مع الشخص نفسةاو كل عصابتة ",
    "options": [
      "نعم، العداوة مع العصابة كاملة.",
      "لا فقط مع المنفذ.",
      "نعم تعتبر عداوة بعد قتلك منه.",
      "السيناريو بأكمله خاطئ."
    ],
    "answer": 0
  },


{
    "id": 37,
    "question": "اثناء ماكنت تبحث عن رهينه.قام باستيقافك عسكري بسبب قطعك لاشارة المرور فقمت بخطفه بعد تهديده هل قمت بتصرف خاطئ",
    "options": [
      "نعم إذا كنت بحاجه لرهينه.",
      "نعم تصرف خاطئ لأنه مخالف لقانون ال MRP(Minimal RolePlay).",
      "نعم تصرف خاطئ",
      "مسموح إذا لم يكن لديه مانع."
    ],
    "answer": 2
  },


 
{
    "id": 38,
    "question": "كنت في سرقة هيومن لا وقمت بارتداء عدة الغوص وهربت من الخلف للخروج الى اليابسة وعند خروجك تفاجئت بوجود شرطي في اليابسة من الخلف وقمت انت بااطلاق النار عليه هل يجوز ذالك ",
    "options": [
      "لا,لايجوز ذالك ",
      "نعم،يجوز ذالك  .",
      "مسموح بشرط ان يكون المطلق الشرطي.",
      "لا لايجوز ذالك ولاكن الموقف كان يستدعي ذالك"
    ],
    "answer": 0
  },


{
    "id": 39,
    "question": "هل يحق لك مشاهدة بث مباشر للسيرفر وأنت داخل المدينة؟",
    "options": [
      "مسموح لو البث بدون صوت.",
      "مسموح من الجوال الذي في داخل  الرول بلي.",
     "ممنوع لأنه ميتا جيمنج.",
      "نعم في حال التعلم."
    ],
    "answer": 2
  },
 
{
  "id": 40,
  "question": "كنت داخل حارة عصابة، وواحد رفع عليك سلاح أبيض بدون ما يضربك ولا يحكي، فقمت بقتله مباشرة.ما نوع المخالفة؟",
  "options": [
    "لا توجد مخالفة لأنه رفع السلاح.",
    "لا,لانه لم يتم التهديد او الحوار",
    "PowerGamingلا, لأنه قتل غير واقعي.",
    "NVL نعم لأنك لم تخف على حياتك."
  ],
  "answer": 1
},


   
{
        'id': 41,
        'question': "أثناء التحقيق مع مجرم في المركز، قام الضابط بتفتيشه وسجنه دون إبلاغه بجريمته. ما الخطأ هنا؟",
        'options': [
            "لا توجد مخالفة، التحقيق كان مختصر.",
            "خرق قانون العدالة.",
            "خرق لقانون السجون.",
            "خرق لقانون الشرطة: يجب إعلام المجرم بجريمته والغرامة."

        ],
        'answer': 3
    },


]

@app.route('/')
def exam():
    selected_questions = random.sample(questions, 20)
    session['questions'] = selected_questions  # نخزن الأسئلة في الجلسة
    return render_template('exam.html', questions=selected_questions)

@app.route('/submit', methods=['POST'])
def submit():
    selected_questions = session.get('questions', [])
    score = 0
    wrong_answers = []

    for q in selected_questions:
        selected = request.form.get(f'q{q["id"]}')
        correct = q['answer']
        if selected is not None and int(selected) == correct:
            score += 1
        else:
            wrong_answers.append({
                'question': q['question'],
                'selected': int(selected) if selected is not None else None,
                'correct': correct,
                'options': q['options']
            })

    return render_template('result.html', score=score, total=len(selected_questions), wrong_answers=wrong_answers)


if __name__ == '__main__':
    from os import getenv
    app.run(host='0.0.0.0', port=int(getenv('PORT', 5000)))





